
[






    
    {
        "title": "Data sources",
        "content": "Searching for data (Googling)\n\nSearch by file type by adding to your search\n\n\n  look only for spreadsheets filetype:XLS filetype:CSV\n  look for geodata filetype:shp\n  look for database extracts filetype:MDB, filetype:SQL, filetype:DB\n  look for PDF files filetype:pdf\n\n\nSearch by part of a URL\n\n\n  inurl:downloads filetype:xls will try to find all Excel files that have “downloads” in their web address\n  site:agency.gov to limit your search to only those results on a single domain name\n\n\nSearch for bulk data\n\n\n  site:agency.gov Directory Listing may give you some listings generated by the web server with easy access to raw files\n\n\nMore on finding data / advanced Googling\n\n\n  🔗 ProPublica’s slide dek “Where to find data”\n  🔗 Learno’s Google search for journalists\n  🔗 Full list of advanced search operators\n\n\nBasic web scrapping\n\n\n  Use existing function in Google Spreadsheets or Excel to import data\n    \n      IMPORTXML: Imports data from any of various structured data types including XML, HTML, CSV, TSV, and RSS and ATOM XML feeds.\n      IMPORTRANGE: Imports a range of cells from a specified spreadsheet.\n      IMPORTFEED: Imports a RSS or ATOM feed.\n      IMPORTDATA: Imports data at a given url in .csv (comma-separated value) or .tsv (tab-separated value) format.\n    \n  \n\n\n=IMPORTHTML(\"https://en.wikipedia.org/wiki/List_of_lakes_of_Ontario\", \"table\", 1)\n=IMPORTHTML(URL, query, index)\n\nStep-by-step explanation\n\nStep 1. Find the data (in a table, url with .csv/.tsv, RSS feed, or XML). Check that data is available as an HTML table (check using Developer Tools); make note of the number of tables on the page. Grab the URL of the webpage.\n\n\n\nStep 2. In a blank Google Spreadsheet, in cell A1 (top left cell), insert a IMPORTHTML function, supplying the URL, query, and index\n\t- URL: where you are retrieving the data from\n\t- query: what you are retrieving from the webpage\n\t- index: which number of the query you are retrieving (ie., if there are 3 tables on a page, specify which table you need)\n\n\n\nStep 3. This data is connected to the live data (ie., the webpage). To sort the data, or create a Pivot Table, be sure to copy the table and, in a new table, use Paste special to paste the table data. OR download the data as a CSV (File &gt; Download as &gt; Comma-separated values) then import into a new sheet (File &gt; Import) — use this option for large datasets, or datasets with a lot of numbers (especially dates as these numbers will often be truncated when using copy/paste).\n\n\n\nMore on importing data\n\n  Google Spreadsheet support docs\n  Importing JSON\n\n\nPulling data from the Network tab\n\nWhat is the Network tab?\n- a tab in Developer Tools that allows us to look at requests being made on a page\n- Developer Tools records all network requests in the Network panel\n\t- we can look JavaScript/CSS files loading in the webpage\n\nStep-by-step explanation\n\n\n  Using the Network tab  to extract every incident noted on this Vision Zero map\n\n\nStep 1: Open Developer Tools (right-click + inspect, or View &gt; Developer &gt; View Source)\n\t* refresh the page (command + R)\n\n\n\nStep 2: Look at XHR - this section contains all XHR/fetch requests being made (ie., to get JSON data)\n\t* click the query in the Name section\n\t* look at the request\n\t\t* Headers: headers sent with the request for data\n\t\t* Preview: what comes back (expand Features)\n\t\t* Response: raw data\n\t\t* Timing: how long it took\n\n\n\nStep 3: Copy + paste into a formatter to make human-readable).\n\n\n  save as JSON\n  convert to CSV\n\n\n\n\nMore on the network tab\n\n  🔗 Google support docs\n\n\nData sites and services (an incomplete list)\n\nCanadian data\n\n  Toronto\n    \n      Toronto’s Open Data Catalogue\n        \n          data/maps kept by the city\n          data: 311 calls, 911 calls, restaurant inspections, subway outages, parking tickets, etc.\n          example:\n            \n              Basement flooding by ward\n              what: service requests by ward due to basement flooding\n              how much: 12 years of data for all 42 wards\n              available as: CSV/Excel sheet\n            \n          \n        \n      \n      Public Safety Data Portal\n        \n          data: major crime, homicide, traffic signal, fatal collisions, etc.\n          maps: crime, service calls, etc\n        \n      \n      City of Toronto’s Lobbying Registry\n        \n          names of every lobbyist at City Hall\n          search functionality\n        \n      \n      Councillor’s Business Expenses\n        \n          Toronto city council expenses by councillor since 2013\n          available as table(s)\n          Constituency office expenses since 2013\n          council general expense\n          council travel expense\n        \n      \n    \n  \n  Ontario\n    \n      Open Data Portal\n        \n          government data\n          example:\n            \n              Government of Ontario art collection\n              what: basic information about the Ontario government’s art collection, dates back to 1853\n              how much: ~2,700 original works of art\n              available as: CSV\n            \n          \n        \n      \n      Registry of lobbyists\n        \n          searchable database of active/inactive lobbyists at Queen’s Park\n        \n      \n      Sunshine List\n        \n          all public sector employees who were paid $100,000+\n        \n      \n      Elections Ontario\n        \n          names of those who made contributions to political parties\n        \n      \n    \n  \n  Federal (Canada)\n    \n      Open Government Portal\n      75,000+ datasets tied to various ministries/agencies\n        \n          example:\n            \n              Art Bank Collection\n              what: contemporary Canadian art\n              how much: 17,000 paintings, prints, photographs and sculptures by some 3,000 artists\n              available as: XML\n            \n          \n        \n      \n      Statistics Canada\n        \n          Census data\n          The Daily\n          StatsCannabis: user-generated data on cannabis prices across the country\n        \n      \n      Trade data online\n        \n          statistics on international trade\n        \n      \n      Transportation Safety Board\n        \n          every plane, train or boat accident or incident\n        \n      \n      The Registry of Lobbyists\n        \n          lobbyists in Ottawa\n        \n      \n      Recall and safety alerts database\n        \n          searchable database of recalls\n        \n      \n      Government-tendered contracts\n        \n          All contracts awarded by the Canadian government and how much they cost\n        \n      \n      Canlii\n        \n          searchable databases of lawsuit filed in Canada\n          available by province\n        \n      \n      Bankruptcy and Insolvency\n    \n  \n\n\n\n\n\nAnd also:\n\n  Creating or collecting data yourself\n    \n      crowd-sourcing\n      live data (social media analytics)\n      web scrapping\n      ATIPs\n      leaks/data dumps\n      FOIs, etc.\n    \n  \n\n\nMore on data\n\n  🔗 Data Journalism Handbook\n\n\n\n",
        "link": "twitter.com/JessieWillms/02_working_with_data/00_data_sources.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Checking data",
        "content": "\n\nChecking data\n\nDownload all the data used in these examples: data_working_with_data.zip\n\nA quick scan of the dataset –\n\n\n  \n    \n      Questions to ask your data\n    \n  \n  \n    \n      Are there missing or truncated values?\n    \n    \n      Are there out of range values?\n    \n    \n      Look at all the values that appear in a column/row – do they make sense?\n    \n    \n      Are there similar repeated values?\n    \n    \n      Is the data format what you would expect for the data type?\n    \n    \n      How was the data collected? Is it from a survey (survey – online survey vs. phone calls)?\n    \n    \n      How was the data verified? If data is entered by hand by a human person, how was it verified?\n    \n    \n      When was the data collected?\n    \n    \n      What is the gap between being collected and published? ie., there will always be a lag between when census data is collected from Canadians and when it is made available (to download/access)\n    \n  \n\n\nCheck for skewed data\n\n\n  Inflation\n  Currency inflation means that over time money changes in value\n  Check with the source of the data to see if the numbers are adjusted\n  How to correct Adjust the numbers for inflation (for example: using the Bank of Canada’s inflation calculator )\n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Housing prices since the 1950s Wow! Homes got expensive! Adjusted for inflation, the 1950 home was $44,600. Still a big spike, but less drastic (and other factors, like the size of homes changing, can help explain this change).\n      \n    \n  \n\n\nmedian_housing_price.csv\n\n\n  Seasonal variation\n  Many types of data fluctuate naturally due to some underlying forces.\n    \n      for example: employment fluctuating with the seasons (ie., around the Christmas season, or summer months)\n      check if the data has been “seasonally adjusted”\n    \n  \n  Timeframe or frame of reference has been manipulated\n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      MTV’s Teen Mom vs. teen birth rate Teen Mom aired its first season in the summer of 2009. The following year the teen birth rate dropped 3.6%, and the rate continued to drop every year following — is an MTV reality television to thank for this drop in teen pregnancy? What was the historical trend?\n      \n    \n  \n\n\nteen_pregnancy.csv\n\nCheck for missing values or zeros/arbitrary values replace missing values\n\n\n  Blank / “null” values\n    \n      Check for blank or “null” values\n      Confirm what blank or “null” values mean (ie., is the value unavailable, missing, etc.)\n      Data is missing\n        \n          ie., if a dataset is supposed to be about “Canada,” check that all 10 provinces and 3 territories are reflected in the data\n          do a first pass on a dataset to make sure the data provided matches what you expected\n        \n      \n    \n  \n  When in doubt: Go back to the source of the data to confirm why a value is missing, zero (0), or null\n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      2018 Toronto condo sales date If a data set is to represent a full year, check that all months are recorded\n      \n    \n  \n\n\nCheck for units, categories, and labels\n\n\n  Currency\n    \n      Check if foreign prices may be specified in their local currency\n        \n          ie., is you data in USD or CAD? 🔗 RBC calculator\n        \n      \n      What year is the dollar value from\n        \n          ie., a $100 in 2010 is not $100 in 2019\n          Check and adjust for inflation 🔗 Bank of Canada calculator\n        \n      \n    \n  \n  Categories\n    \n      Bad categories can artificially exclude data.\n      For example: crime statistics. A bad or changing definition might mean a crime is counted in a different category than you expect or that it wasn’t counted at all.\n    \n  \n  Labels\n    \n      Ambiguity = a likely error\n      Confirm with the source of the dataset your understanding matches their definitions\n  \n    \n  \n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Column labels are too broad or unclear Both earnings and dollars are bad column headers. Once you divide the dollars value by the shows_played_2101 value, it is clear that dollars refers to total earnings for the complete tour in 2018. The headers should be updated to reflect the content (the total per tour earning, and the per show earnings).\n      \n    \n  \n\n\nhighest_grossing_tours_2018.csv\n\nCheck for inconsistencies\n\n\n  Spelling is inconsistent\n    \n      Check that location/place names are consistent\n        \n          ie., Los Angelos instead of Los Angeles\n        \n      \n      Check locations for inconsistent spelling, or inconsistent short forms/abbreviations\n        \n          ie., both Sault Sainte. Marie and Sault Ste. Marie\n        \n      \n      Often indicates that the data was compiled by a human person, reason to be skeptical of the data\n      You will need to manually correct mistakes or otherwise account for them in your analysis and reporting\n      Be sure to document your changes\n    \n  \n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Inconsistent place names Here are three options for a city in Ontario. Which is correct?\n      \n    \n  \n\n\nplace_names.csv\n\n\n  Name order is inconsistent\n    \n      Check that first_name and last_name are accurately reflect the content\n    \n  \n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Checking names Can you spot the celebrity whose name is incorrectly entered?\n      \n    \n  \n\n\nnames.csv\n\n\n  Date formats are inconsistent\n    \n      Check that all dates are day/month/year or month/day/year\n      Check that dates use consistent year formats (ie., 2015 vs 15)\n        \n          ie., both 10/9/15 and 9/10/15 are valid date formats, but are they the same date?\n        \n      \n      Where did the data originate? (European vs. American date formats). If you are unsure, check with the source.\n    \n  \n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Checking dates There are four different dates formats here. If the data was collected in Canada, which format should be used?\n      \n    \n  \n\n\ndate_formats.csv\n\nCheck for numbers as text and text as numbers\n\n  Not all numerals are numbers\n  Spreadsheets programs often make the mistake of assuming numerals are numbers and stripping the leading zeros.\n    \n      ie., New England zip codes almost always start with zero, i.e. 02901\n      Excel assumes it’s numeric and “helpfully” drops that leading zero, making the value inaccurate\n    \n  \n  Good practice is to store numbers without formatting and to include supporting information in column names or metadata.\n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Checking numberical values It looks like some of these number values are formatted incorrectly — check that it is a formatting error (and not something else)\n      \n    \n  \n\n\nZeros replace missing values / data is missing\n\n  If you see zeros in a series of numbers you should ask yourself if those values are really the number 0 or if they instead mean \"nothing\". (-1 is also sometimes used this way.)\n\n\n\n  \n    \n      Example\n      What does it look like\n    \n  \n  \n    \n      Checking for zeros Did Bruno Mars really make millions of dollars playing a negative number of shows?\n      \n    \n  \n\n\nCheck number of columns and rows\n\n  Excel has (had) a maximum of 65,536 rows. If your dataset has 65,536 rows, you likely have a portion of the data. Go back to the source to confirm or request the full dataset.\n  Apple’s Numbers can only handle 255 columns. If 255 rows, you might only have a portion of the data. Go back to the source to confirm or request the full dataset.\n\n\nCheck for these suspicious values\nIf you see any of these values in your data, treat them with an abundance of caution:\n\nNumbers:\n\n\n  65,535\n  255\n  2,147,483,647\n  4,294,967,295\n  555-3485\n  99999 (or any other long sequence of 9’s)\n  00000 (or any other sequence of 0’s)\n\n\nDates:\n\n\n  1970-01-01T00:00:00Z\n  1969-12-31T23:59:59Z\n  January 1st, 1900\n  January 1st, 1904\n\n\nSpreadsheet has dates in 1900, 1904, 1969, or 1970\n\nExcel’s default date from which it counts all other dates is January 1st, 1900, unless you’re using Excel on a Mac, in which case it’s January 1st, 1904. There are a variety of ways in which data in Excel can be entered or calculated incorrectly and end up as one of these two dates. If you spot them in your data, it’s probably an issue.\n\nMany databases and applications will often generate a date of 1970-01-01T00:00:00Z or 1969-12-31T23:59:59Z which is the Unix epoch for timestamps. In other words this is what happens when a system tries to display an empty value or a 0 value as a date.\n\nLocations:\n\n\n  0°00'00.0\"N+0°00'00.0\"E or simply 0°N 0°E\n  US zip code 12345 (Schenectady, New York)\n  US zip code 90210 (Beverly Hills, CA)\n\n\nEach of these numbers has an indication of a particular error made by either a human or a computer. If you see them, ensure they actually mean what you think they mean!\n\nNote: Many of these tips are pulled from Quartz’s Bad Data Guide.\n\nMore on checking data\n\n\n  🔗 Quartz’s full Bad Data Guide\n  🔗 ProPublica’s Bulletproofing Your Data Guide\n\n\n\n\nHomework:\n\nCreate an account on Learno.\n\nComplete module 1 and 2 from Cleaning data in Excel. Feel free to use Google Spreadsheets when working with the data.\n\n\n\n\n",
        "link": "twitter.com/JessieWillms/02_working_with_data/01_checking_data.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Introduction to visualizing data",
        "content": "Tools for visualizing data\n\n\n\n  DataWrapper\n  Google Charts\n\n\nCreate an account for DataWrapper.\n\nUsing charts\n\nAs a reporting tool, charts are useful to:\n\n\n  Identify themes or trends in the data\n    \n      helps identify a “typical” example\n    \n  \n  Identify questions to answer in the rest of your reporting\n  Quickly understand the data or find questions answer\n    \n      ie., a quick bar chart can show the distribution of data\n    \n  \n  Show outliers in the data\n    \n      sometimes this could be a story lead to pursue\n      sometimes this could be a hole or error in the data\n    \n  \n\n\nAs a visual element (for readers), charts are useful to:\n\n\n  Highlight/reinforce the key point of a story\n  Show trends over time\n  Make/show comparisons\n    \n      better/ worse than\n    \n  \n  Show relationships\n    \n      correlations between variables\n    \n  \n  Show the movement or flow of data\n    \n      how data points move between groups\n    \n  \n  Show an outliers in the data\n  Can allow you to remove paragraphs of numbers from a story\n\n\nChart types\n\nBasic/common charts:\n\n📊 Bar/column charts:\n\n\n  Best for discrete units of measurement\n  Each bar is used to show discrete, numerical comparisons amongst categories\n  One axis shows value scale, other shows categories compared\n    \n      Axis always starts at zero\n    \n  \n\n\n\nView chart\n\nMultiline bar/column charts:\n\n\n  Multi-set or stacked\n  Useful alternative to pie charts\n  Bars of multiple datasets stacked on top of each other\n  Simple Stacked Bar Graphs: adds each segment of data in a row\n  100% Stack Bar Graphs: adds each proportional segment of data in a row; adds up to 100%\n    \n      use this as an alternative to pie charts\n    \n  \n\n\n\nFacebook active users chart\n\n📈 Line charts\n\n\n  Best for showing a continuous value/set of values\n    \n      Show trends, analyze how data changes over time\n    \n  \n  Slope of the line between two points shows change pattern\n  Plot a point on X / Y axis, connect each point with a line\n    \n      Y axis: quantitative\n      X axis: time/sequential (ie., dates)\n    \n  \n  X axis does not necessarily have to start at zero\n\n\nSingle line charts\n\n\n  Show change of one variable/category over time\n  Good for: prices (stocks, housing/rent, )\n\n\n\nTilray stock\n\nMulti-line chart\n\n\n  Shows many lines (series)\n  Should limit of 3-4 lines (more than that becomes difficult to read/understand)\n  Or: show one line (highlighted colour) against many lines (grey/neutral colour)\n\n\n\nMid-term election explainer\n\nAdvanced charts:\n\n\n  Area graph\n  Scatterplot\n    \n      plot data points against two variables (on the X and Y axis)\n      useful to see if a relationship (correlation) exists\n      shows patterns or relationships\n    \n  \n  Sankey\n    \n      flow diagram\n      shows movement from one set of values to another\n    \n  \n  Histograms\n\n\nCharts to avoid\n\n🥧 Pie charts\n\n\n  Show proportions or percentages of categories  \n  Each slice of the pie (chart) represents a % of the total (100%)\n  Pie chart cons:\n    \n      hard for readers to understand many data points (ie., very slim slices of pie)\n      bad for comparison\n    \n  \n\n\nPoor uses of the pie chart\n\n Link\n Link\n\n\n  If you use a pie chart:\n    \n      use no more than 3 categories of data\n      best option is to compare a part to the whole (“one against all others”)\n    \n  \n\n\nA better use of the pie chart\n\n\n\n  Alternative: Stacked Bar Graph\n    \n      use a bar chart/stacked bar chart\n      square pie or waffle chart skip to: “Alternative: Squaring the Pie”\n    \n  \n\n\nMore on pie charts 🥧\n\n  🔗 What to consider when creating pie charts\n  🔗 In defense of the pie chart\n  🔗 Understanding Pie Charts\n\n  🔗 The hate of pie charts harms good data visualization\n\n\nWhen NOT use a chart\n\n\n  When you have a very limited amount of data points\n  When the data shows lot of fluctuation, or a flat trend\n  When it could be a table\n\n\nWhat information should you include in a chart\n\nInformation you must include\n\n\n  Title\n  Data source\n\n\nInformation you should include\n\n\n  Formatting symbols\n    \n      $ for monetary values, % if value is a percentage, etc.\n    \n  \n\n\nOptional information to include\n\n\n  Sub-title\n    \n      Add when supplementary information is necessary\n    \n  \n  X/Y axis labels\n    \n      Add labels when useful to provide additional context/information\n    \n  \n  A legend: if you have data with categories\n    \n      Use to explain why a bar/line uses a specific colour\n    \n  \n\n\nMore on delivering data visualizations\n\n\n  🔗 Different Charts Tell Different Tales\n  🔗 Data Journalism Handbook\n\n\nReview\n\n  Which type of chart us best used to display or analyze trends over time?\n    \n      A line chart\n    \n  \n  Why should you avoid pie charts?\n    \n      It is often difficult for a reader to understand how much each slice of the pie represents.\n    \n  \n  What is a useful alternative to the pie chart?\n    \n      A stacked bar chart.\n    \n  \n  True or false: The X axis of a bar chart does not need to start at zero.\n    \n      False. The X axis of a bar chart must start at zero to avoid misrepresenting the data.\n    \n  \n  Which type of chart is best used to display numerical comparisons among categories?\n    \n      A bar chart\n    \n  \n  Which (advanced chart) can be used to determine if a relationship (correlation) exists between many data points?\n    \n      A scatterplot chart\n    \n  \n\n",
        "link": "twitter.com/JessieWillms/4_visualizing_data/01_intro_to_data_visualization.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "What is a spreadsheet",
        "content": "Spreadsheet basics\n\n💻 Working with spreadsheets 💻\n\n👽 🛸 To practice your spreadsheet skills, download this CSV: ufos.csv\n\n\n  To follow along, open in Excel or Google Spreadsheets\n    \n      Download the CSV (remember where on your computer its saved!)\n      Open Google Spreadsheets or Excel\n      Import the file (File &gt; Import)\n      Make sure the spreadsheet/tab has a title\n      Save the file (command + S on a Mac, control + S on a PC)\n    \n  \n\n\n\n\n\nA spreadsheet\n\n\n  A spreadsheet is a computer program\n  Allows for simple or complex calculations on a series of numbers at the same time\n  We use Excel or Google Spreadsheets to view and work with spreadsheets\n\n\n\n\nA worksheet\n\n  One page (or one “tab”)\n  Grid of rows and columns\n  Each “workbook” (the overall Excel/Google Spreadsheet file) can contain many worksheets\n\n\nRows\n\n  Horizontal (width of page)\n  Each row: a “data point”\n  First row: “header row” which contains column labels\n\n\n\n\nColumns\n\n\n  Vertical (height of page)\n  Contain “variables” or categories\n    \n      ie., each cell in the column contains “date” information\n    \n  \n\n\n\n\nCells\n\n\n  Intersection of a column and a row\n  Starts with A1 (upper left corner)\n    \n      ROW: 1\n      COLUMN: A\n    \n  \n\n\n\n\n\n\nData types\n\nNumerical\n\n\n  Numeric/decimals\n    \n      counts, sums, dollars, dates/times\n      Used for calculations\n    \n  \n\n\nFormatting numerical values\n\n  Numbers should be right-aligned\n    \n      Google/Excel might try to be helpful, and will often do this for you\n      If “number” is not right-aligned, check for error(s)\n    \n  \n\n\n\n\n\n  Formatting options for numbers:\n    \n      As currency/money - ($)\n      As percent (%)\n      Change/adjust decimal(s) (rounding)\n    \n  \n\n\n\n\nText (“strings”)\n\n\n  Names, addresses, descriptions, postal codes (anything that is not a number)\n  Not used for calculations\n    \n      However, can use a function to split or concatenate text\n      ie., merge several columns of data into a new column (ie., join text into an andress)\n    \n  \n  Left aligned\n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/01_what_is_a_spreadsheet.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Cleaning data",
        "content": "Refer to previous lessons for checking data\n\nCleaning data: correcting the problems we check for\n\nNote: Many of these tips are pulled from Quartz’s Bad Data Guide.\n\nFixing stuff\n\n  TK\n\n\nMore on cleaning data\n\n\n  🔗 Learno’s Cleaning Data in Excel\n\n",
        "link": "twitter.com/JessieWillms/02_working_with_data/02_cleaning_data.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Data visualization mistakes and how to fix them",
        "content": "Common chart mistakes\n\nOrdering data\n\n\n  Your data should be sorted in a meaningful way:\n    \n      ordered values by most to least\n      ordered by by year\n    \n  \n\n\n\n  \n    \n      Example\n      Chart (before/after)\n    \n  \n  \n    \n      Order data by rental cost A bar chart about the cost of renting in cities across Canada should be ordered by the value (renting) instead of an alphabetical list of cities.\n      \n    \n  \n\n\nLabels become difficult to read\n\n\n  Too many labels, or labels are too long\n  How to fix\n    \n      Show fewer bars (top 10)\n      Use horizontal version of the chart\n      labels are on the Y axis (unless chart is a time series)\n      Rotate labels to 45 deg\n    \n  \n\n\n\n  \n    \n      Example\n      Chart (before/after)\n    \n  \n  \n    \n      Labels on the X axis vs. on the Y axis. In this bar chart, we transposed the data and reduced the number of cities being shown (only show 10 most expensive places)\n      \n    \n  \n\n\nColour\n\n\n  Use gradient colors to show a pattern (or range) in the data\n    \n      Light colors representing lower values\n      Dark colors representing higher values\n    \n  \n  No more than 5 colours\n    \n      If you have more than 5 colours (categories), regroup your data (or use an “other” category to collect less significant categories)\n      Use a legend to explain significance of colours (categories)\n    \n  \n  One colour for all bars or one colour per category of data\n  Make all bars a neutral colour (grey) and use secondary colour to highlight a specific bar\n    \n      🔗 Example: Market capitalizations of select companies\n    \n  \n  Ensure you are using high-contrast colour options\n\n\n\n  \n    \n      Example\n      Chart (before/after)\n    \n  \n  \n    \n      Many colours vs. neturals Since each bar is a different colour, the colour choices do not communicate any additional information. We can replace the colours with one, neutral option.\n      \n    \n  \n\n\nUseless comparisons\n\n  A comparison of absolute vs. proportional values\n    \n      ie., total number of births by province vs. birth rate by province (births per 1,000 women)\n    \n  \n  Prices that are not adjusted for inflation\n    \n      $100 in 1981 != $100 in 2019\n    \n  \n\n\nThe baselines must accurately reflect the data\n\n  Bar charts must always have a baseline of zero\n  Line charts do not need to start at zero\n    \n      but be careful that you are not misrepresenting the data\n    \n  \n\n\n\n  \n    \n      Example\n      Chart\n    \n  \n  \n    \n      A faulty baseline The baseline does not start at 0, wildly misrepresenting the data.\n      \n    \n  \n\n\nMisc.\n\n  The math should make sense\n    \n      If you have a pie chart, do your slices add up to 100%?\n    \n  \n  Label your axes\n  Use a legend (to explain your colour choices/categories)\n  Cite your sources\n  Never make your chart 3D\n\n\nEditing your charts\n\n  We all make mistakes (this is why we have editors)\n    \n      When in doubt (even when confident!), ask for a second pair of eyes\n    \n  \n  Walk someone else through your charts, they might catch assumptions or mistakes you missed\n\n\nLet us avoid avoid embarrassing chart mistakes this inforgraphic from 2011 that breaks literally every rule ^^ above) A v. bad infographic\n\nMore on charting rules and best practices\n\n  🔗 What to consider when choosing colors for data visualization\n  🔗 Flowing Data - Chart Rules\n  🔗 Flowing Data - Useless Data Comparisons\n  🔗 Flowing Data - Bar Chart Baselines Start at Zero\n\n\nExercise\n\nBad charts\n",
        "link": "twitter.com/JessieWillms/4_visualizing_data/02_data_visualization_mistakes.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Spreadsheet basics",
        "content": "“Paste special” / “Paste transposed”\n\n  “Paste special”: to paste values without special formatting\n    \n      when you execute a function in\n      copy this data into a new\n    \n  \n  see also: transpose functions (TK)\n\n\nThe header row\n\n  The first row of data in a spreadsheet is usually reserved for column headers\n  Labels that identify what content is in each column\n    \n      sometimes in short forms (ie., lat vs. latitude, AdvDeg vs. average_degree_score)\n      when in doubt, check with the spreadsheet author\n    \n  \n  For very long spreadsheets, useful to “freeze” the top row\n    \n      so you can view labels and values at the same time\n\n    \n  \n\n\nHow to “freeze” header row\n\n\n  Ensure first row in the spreadsheet contains labels (if not: insert a row, add labels for each column)\n  In Google Spreadsheets: Under View &gt; Freeze &gt; 1 row / 1 column\n\n  In Excel: Under View &gt; Freeze top row\n\n  Scroll up/down and left/right with labels in view\n\n\nConditional formatting\n\n  Useful way to highlight (colour-code) cells\n    \n      ie., show empty cells, or cells where the value is &gt;= another value\n    \n  \n  A range of colours\n  A darker shade of red for UFO sightings with longer duration\n\n\n\nA range of colours\n- Turn cells black if the “Color” value is empty.\n\n\n“Freeze” header row\n\n\n  Format &gt; Conditional formatting ... &gt; in the Conditional format rules editor, set rules for the selected cells\n    \n      Apply to range: the data to evaluate\n      Format cell if: select the rule to evaluate\n      Formatting style: select colour option\n        \n          single colour: ie., make all empty cells black\n          color scale: ie., a range of colours reflecting values in a range\n        \n      \n      Done: apply formatting\n    \n  \n\n\nCreating a “counter”\n\n\n  Create a “counter”\n    \n      Why: use this column to “un-sort” the data\n    \n  \n  How to:\n    \n      Insert new column, give it a name\n      Define a pattern (1, 2, 3)\n      Highlight cells with the pattern, drag or double-click to populate column\n    \n  \n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/02_spreadsheet_basics.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Tips for working with spreadsheets",
        "content": "Spreadsheet 🌶 tips\n\nMake a copy\n\nAlways, always, always: make a copy of your spreadsheet.\n\nAlways, always, always: work in the copy of your spreadsheet.\n\nAlways, always, always: Have a backup of your data.\n\nWhy? You will make mistakes and mess up a spreadsheet of information. You need to have a way to revert all your changes without affecting the integrity of the data.\n\nMake it clear ~in the name of the file~ that you are working with a copy of your data. For example: ufo-sightings-COPY.csv and ufo-sightings-ORIGINAL.csv\n\nAlso be sure to save the original data on a USB, Google Drive, external hard-drive.\n\nYour project folder should look something like this:\n\n\n  containing project folder (my_data_project)\n    \n      a COPY of the original dataset (ufos_BACKUP.csv or ufos_COPY.csv)\n      the Excel file with your analysis/changes (ufos.csv)\n      a text file that outlines your workflow/documents your dataset (README.md - or a data dictionary)\n    \n  \n\n\n\n\nAdd permission settings\n\nAdd permissions/rules to the original so that only you can access it.\n\nIn Excel, you can add a password to a spreadsheet.\n\nIn Google Spreadsheets, you can add “rules” to adjust settings by user.\n\nKeep notes about your workflow, etc.\n\nCreate a text document for future reference. Keep notes about when the spreadsheet was last updated/edited (this is especially important for ongoing work or collaborative work).\n\nFor example: if you create a column for the result of a function/calculation, make a note of the column, the calculation, and the expected result.\n\nRecord a reference of short-forms/codes, etc. you use.\n\nThe Pudding’s README.md for their piece “Internet Boy Band Database”\n\nName: Jessie Willms\nContact: jwillms@email.com\nDate: Jan. 14, 2019\n\nData: This spreadsheet contains UFO sightings that took place in Ontario in 2012.\nThe sightings were compiled from the website ufosightings.com.\nThe spreadsheet contains 101 rows and 17 columns.\n\nAnalysis: Created a Pivot Table to find the total number of \"red\" sightings that happened in the summer (May-August).\n\nProcess: I used this function to show sightings that were longer than 10 seconds: =IF(M4&gt;10,1,0).\n\nThe function executes in column H (long_sightings), with a value of 1 when true, and 0 when false.\n\n\n\nWhy do this\n\n\n  \n    Current you: writing out your process provides an opportunity to proofread/double check your work\n  \n  \n    Future you: you will likely forget exactly what you did; instead of guessing, you will have the steps you took, and know how to repeat it.\n  \n\n\nFor example: Your original reporting about bicycle thefts in Toronto includes data for 2010 to 2017. In January 2019, Toronto Police release data for 2018. You should be able to repeat your initial analysis in January 2019. Ensure you have sufficient notes to make this possible.\n\n\n\n  In addition:\n  Someone else (a data editor) can check your work\n  Another data reporter should be able to reproduce your results\n  Use this information to share your methodology/process with experts/readers\n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/02_spreadsheet_tips.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Truth and lies in data",
        "content": "What to look for\n\nExercise\n👽 🛸 Download zip of CSVs: tk.csv\n\nFor each CSV, complete the following:\n\n\n  Import CSV into Excel or Google Spreadsheets\n    \n      Download the CSV (remember where on your computer its saved!)\n      Open Google Spreadsheets or Excel\n      Import the file (File &gt; Import)\n      Make sure the spreadsheet/tab has a title\n      Save the file (command + S on a Mac, control + S on a PC)\n    \n  \n  Make a copy / add permissions\n    \n      Make a copy of the file\n      Ensure the file names reflect ^^\n      Open the copy in Google Spreadsheets or Excel\n      Add rules/permissions to prevent others from editing the spreadsheet\n    \n  \n  Explore the data for errors\n    \n      Create a text document to make note of the issues with this data. Respond to the following (bullet points are fine).\n      Outline 2-5 key issues with the data\n        \n          Identify ~what~ the issues are (ie., inconsistent formatting for data)\n          Identify ~how~ the issues might be resolved (ie., edit data to use a consistent format)\n        \n      \n      Is this data set suitable for use in a story? Why or why not?\n      If you believe this data to be okay to publish, pitch a story from this data\n    \n  \n\n\nYour text document might look like this:\n\nData set: ufos_full.csv\n\nIssue #01:\n    - What is the issue: This data is user-generated/collected from the website sightings.com\n    - How to resolve: not possible to cross-reference the data\n    - Is it suitable for a story: No. UFOs are not real.\n\n    Pitch:\n        -  \n\n    headline: Extraterrestrials in Canada? Here's where Canadians believe they are spotting unidentified flying objects\n\n    lead: first sentence\n    nutgraf: 75% of UFOs sightings originate in X city in X province.\n\n    body copy: three bullet points of your story's main ~point*\n\n        - Something\n        - Else\n        - Here\n\n\n",
        "link": "twitter.com/JessieWillms/02_working_with_data/02_truth_lies_data.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Filtering, sorting, and functions",
        "content": "Sorting\n\n\n  \n    Putting your data in an order (A-Z or Z-A)\n  \n  \n    How to (Excel):\n    \n      Select the column\n      In the “Data” tab, click AZ, ZA, or the large Sort icon\n      Ensure option “Expand the selection” is selected\n      Click “Sort”\n    \n  \n\n\n\n\n\n  How to (Google Spreadsheets):\n    \n      Click small caraet on letter cell above header row\n      From dropdown, select Sort sheet ⟶ A-Z\n    \n  \n\n\n\n\nFunctions\n\nWhat is a function?\n\n\n  Goal is to create new information from existing data\n  Functions performs operations on text + numbers\n  For example\n    \n      Numbers:\n        \n          Calculating averages, sums (totals)\n          Finding median, min, max, counts\n          Rounding numbers, calculating time/ranges\n        \n      \n      Strings (text):\n        \n          splitting data into multiple columns (YY-MM-DD to year, month, day),\n          or concatenating (joining) text (city, province, country into one column)\n        \n      \n    \n  \n\n\n\n\nSome common functions\n\nLook at some of these functions in action:\n\n\n\nGetting data\n-Return x character(s) from the left or right of specific cell.\n=LEFT(A2,1)\n=RIGHT(A2,1)\n\nJoining data\n\n\n  \n    Join text together (each cell separated by the delimiter, \"-\"):\n=JOIN(\"-\",D2,E2,F2)\n  \n  \n    Concatenate/join text together (separated by specific text)\n=CONCATENATE=(D2,\" and \", E2, \"will be joined together with pal\", F2)\n  \n\n\nBasic math\n\n\n  \n    Find sum (total) for specific values:\n=SUM(A2, B2, C2)\n  \n  \n    Find sum (total) for a range of values:\n=SUM(A2:A100)\n  \n  \n    Find the average of a specific values:\n=AVERAGE(C2,C5,C10)\n  \n  \n    Find average of a range of values:\n=AVERAGE(C2:C100)\n  \n  Find the median value in a set of values\n  \n    Median: when a set of values is sorted,\n=MEDIAN(C1:C101)\n  \n  \n    Find the highest value(s)\n=MAX(C1:C101)\n  \n  \n    Find the lowest value(s)\n=MIN(C1:C101)\n  \n  \n    Do some simple math (addition, subtraction, multiplication)\n=(C1 / C101)\n=(C1 * C101)\n=(C101 - C1)\n=(C101 + C1)\n  \n  Calculate a date range\n=DATEIF(136)\n\n\nChecking data\n\n\n  \n    Checks one value if a logical expression is TRUE and another if it is FALSE:\n=IF(A2 = \"sunshine\", \"True: Nice weather\", \"False: Lousy weather\")\n=IF(A2 &gt;= 12, 1, 0)\n=IF( (A2 / 10 &gt; 100), 1, 0)\n  \n  \n    Returns the position at which a string is first found within text, case-sensitive:\n=FIND(\"wood\",\"How much wood can a woodchuck chuck\")\n  \n  How it works:\n  =FIND: name of the function\n  (search_for, text_to_search, [starting_at]): inside the round brackets, we have two mandatory parameters, and one optional parameter\n  search_for: the first parameter; the sub-string (text) to look for\n  text_to_search: the second parameter; where to look\n  \n    [starting_at]: optional third parameter; what character to start looking\n  \n  Returns the position at which a string is first found within text, ignoring case.\nSEARCH(\"wood\",\"How much wood can a woodchuck chuck\")\nSEARCH(search_for, text_to_search, [starting_at])\n\n\nChecking data types\n\n\n  \n    Checks if data is a string (text)\n=ISTEXT(\"sunny weather\")\n=ISTEXT(8)\n  \n  \n    Checks if data is a boolean (true/false) value\n=ISLOGICAL(TRUE)\n=ISLOGICAL(B12)\n  \n  \n    Checks if data is a number\n=ISNUMBER(136)\n=ISNUMBER(B12)\n  \n\n\nError handling\n\n\n  \n    Checks if a cell value is equal to an error (#N/A)\n=ISNA(A2)\n  \n  \n    Checks for an error in a specific cell\n=IFERROR(A1,\"Error in cell A1\")\n  \n\n\nFor more practice with functions, work through these problems \n\nGetting data\n\n\n  \n    Import a table of data from the internet\n=IMPORTHTML(\"https://en.wikipedia.org/wiki/List_of_2018_box_office_number-one_films_in_the_United_States\", \"TABLE\", 1)\n=IMPORTHTML(\"https://www.canada.ca/en/health-canada/services/drugs-medication/cannabis/industry-licensees-applicants/licensed-cultivators-processors-sellers.html\", \"TABLE\", 1)\n=IMPORTHTML(\"https://www.billboard.com/archive/charts/1991/country-songs\", \"TABLE\", 1)\n  \n  Import a table of data from the internet\n=IMPORTHTML(\"https://en.wikipedia.org/wiki/List_of_2018_box_office_number-one_films_in_the_United_States\", \"TABLE\", 1)\n=IMPORTHTML(\"https://www.canada.ca/en/health-canada/services/drugs-medication/cannabis/industry-licensees-applicants/licensed-cultivators-processors-sellers.html\", \"TABLE\", 1)\n=IMPORTHTML(\"https://www.agco.ca/cannabis/list-ontario-municipalities-prohibiting-or-allowing-cannabis-retail-stores\", \"TABLE\", 1)\n  \n    Important note: check for paginated data (see AGCO example above; this will only return the first 20 results)\n  \n  Import a list of data from the internet\n=IMPORTHTML(\"https://en.wikipedia.org/wiki/List_of_2018_box_office_number-one_films_in_the_United_States\", \"list\", 1)\n\n\nTo find the index of a table:\n\nOpen Developer Tools, copy &amp; paste this function.:\n\nvar i = 1; [].forEach.call(document.getElementsByTagName(\"table\"), function(x) { console.log(i++, x); });\n\nThis will return the index of each table on the page.\n\n\n\n\n  Import a CSV or TSV from the internet\n=IMPORTDATA(\"http://opendata.toronto.ca/building/green.roof.permits/greenroof.csv\")\n\n\n\n\n\n  Import a range of data from another tab/sheet\n=IMPORTRANGE(spreadsheet_key, \"tab_name!A3\")\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d/1X5vqyLf7itgF-b6QZRRoVLuHdlji3mqvTDdKBUy8jG4/edit#gid=1687373309\", \"ufos!A3\")\n\n\nTo practice your IMPORT skills, open import\n\nVLOOKUP\n\n=VLOOKUP(search_key, range, index, [is_sorted])\n\nVLOOKUP looks for a value in a column; then it returns a value from any cell in the same row.\n\nsearch_key: value to find\nrange: two or more columns, to find the data\nindex - the column number from the range; you can return any value in that row\n\nTo practice your VLOOKUP skills, open vlookup\n\nWrapping functions\n\n\n  In the multiple_functions tab\n  we can wrap multiple functions together\n=IF(NOT(ISERR(FIND( \"Disney\", C3, 1))), 1, 0)\n  \n    ^ this is 3 functions in one line; starting from the innermost function\n  \n  1 FIND( \"Disney\", C3, 1)): checks the string in cell C3 to see if the substring “Disney” exists\n  if the substring exists, this will return the position of the substring(a number)\n  \n    if the substring does not exist, it will return an error #VALUE!\n  \n  2 ISERR(value): check if the value is an error\n  in our example, it is checking if FIND( \"Disney\", C3, 1)) returns an error\n  \n    wrapping this in a NOT() function (makes the next step easier)\n  \n  3 =IF( F3 = TRUE, 1, 0): returns 1 or 0 if the cell contains an error\n  use this value to find the total number of Disney movies\n\n\nBreaking down functions\n\n\n\n\n  \n    = to start the function. This cell is where the new value will live.\n  \n  JOIN: the name of the function\n    \n      usually tells you what the function will ~do~\n    \n  \n  (): opening and closing parentheses\n    \n      wrap around the guts of the function\n      think of it as the container\n      contains parameters (arguement)\n    \n  \n  \"-\": the delimiter\n    \n      the text (character) between values\n    \n  \n  D2,E2,F2: the values that are being joined\n    \n      note the reference (D2) to each individual cell\n      if comma separated: individual cells\n      if colon separated: range of cells\n    \n  \n\n\nWhat should we expect to happen when we execute this function?\n\n\n\nA full date in column G:\n\n\n\nMore on functions\n\n\n  🔗 List of Google Spreadsheet functions\n  🔗 List of Excel functions \n\n\nFiltering\n\nCreating a “filtered” view (to find things)\n\n\n  Exact or “fuzzy” matches\n  Show/find ranges (numbers/dates)\n  Filter for specific information (numbers &gt;= X value)\n\n\n🌶️ tip: don’t save the filter; make a copy of the filtered data to work with\n\nMore on filtering\n\n\n  🔗 Google’s “Sort &amp; filter your data” how-to\n\n\nMore on Spreadsheets\n\n\n  🔗 ProPublica’s Intro to Spreadsheets\n  🔗 ProPublica’s String functions\n  🔗 Learno’s Doing Journalism with Data — Module 3: Finding story ideas with data analysis\n  🔗 Learno’s Cleaning data in Excel\n\n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/03_filtering_sorting_functions.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Pivot Tables",
        "content": "Pivot Tables\n\n\n  Pivot Tables are super powerful\n  \n    They can be used to summarize and explore your data quickly, or expose missing/bad data\n  \n  Great for:\n    \n      Count by variables (group)\n      Sum by group\n      Average by group\n      Maximum or minimum by group\n  \n    \n  \n  How to (Google Spreadsheets):\n    \n      Data &gt; Pivot table\n      Opens in a new tab, with the Pivot Table editor open\n      Add/move rows, columns, values, filters\n    \n  \n\n\n\n\nWhat’s happening here?\n\n  Rows the grouping variable\n  Values: the variables we want to summarize – values in our table\n\n\n\n\nIn the Pivot Table editor (right-hand side):\n\n  Data range: what data to get from your worksheet/tab\n    \n      ufo-sightings-ontario-2012!A1:S101\n      gets data from the ufo-sightings-ontario-2012 tab\n      only gets data in the cells from A1 (top left) to S101\n    \n  \n  Rows: Drag fields here to create rows\n    \n      Placing more than one value with create “nested” rows\n    \n  \n  Columns: Drag fields here to create columns\n    \n      Placing more than one value will create “nested” columns\n    \n  \n  Values: Drag fields here to determine the data that is being evaluated\n  Filters: Selectively view data based on particular values\n    \n      can remove missing data, or data in a range, data less/more than x\n    \n  \n\n\nWe can summarize data by:\n\n  COUNTA: gets a tally of cells containing values (ie., how many cells in a column called “Color” have a value of “red”)\n  SUM: the total\n  MIN/MAX: biggest/smallest values\n\n\nHow many sightings in the summer months were red, excluding sightings with fewer than 2 witnesses:\n\n\n\nUsing data from Pivot Tables\n\nWhen you make a pivot table, it remains tethered to the underlying data you used to create it. If the data changes, your table changes. But: editing, sorting, filtering the data is annoying.\n\n\n  Solution: copy + paste the table into a new tab\n  Select table\n  Copy table\n  In a new tab, go to: Edit &gt; Paste special &gt; paste values only\n\n\n\n\nThis table is no longer attached to the data.\n\nIf the data changes, your pasted table WILL NOT automatically update. There is not longer a connection between the Pivot Table and the worksheet.\n\nMore on Pivot Tables\n\n\n  🔗ProPublica Pivot Table how-to guide\n  🔗Google support forum for creating a Pivot Table\n  🔗YouTube video demonstrating how to create a Pivot Table\n\n\nExercise\n\nBack in nhl_player_salaries Practise with functions\n\n\n  Create a Pivot Table to find the average salary per position for 2018-2019, and for 2022-2023.\n  Create a Pivot Table to find which team has the most highest paid players. Name the team, and how many of their player made the list.\n  Create a Pivot Table that returns the totals for each position (ie., how many captains on on the list).\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/03_pivot_tables.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Advanced Pivot Tables",
        "content": "sdf\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/03_pivot_tables_advanced.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Data validation & conditional formatting",
        "content": "Data validation\n\n  Data validation: setting yourself up for success\n  \n    Especially when working with categorical data, make sure you are using the ~same~ categories\n  \n  How to (Google Spreadsheets):\n    \n      Click small caraet on letter cell above header row\n      From dropdown, select Sort sheet ⟶ A-Z\n    \n  \n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/04_data_validation.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "What is \"data journalism\"?",
        "content": "Defining “data journalism”\n\n“Data can be the source of data journalism, or it can be the tool with which the story is told, or it can be both. Like any source, it should be treated with skepticism; and like any tool, we should be conscious of how it can shape and restrict the stories that are created with it.”\n— Paul Bradshaw, Birmingham City University\n\nIt is also:\n\n  Journalism that is done with (informed by) data\n  “Computer assisted reporting”\n    \n      ie., computer programs to help election outcomes\n    \n  \n  A tool for reporting/storytelling.\n\n\nData journalism is NOT\n\n  Just “interviewing” a spreadsheet\n  An beat or expertise for only a select few in a newsroom\n  Real people, experts and “word” reporting are still extremely necessary components of data journalism.\n\n\nWhat does data journalism look like\n\n  Building tools to scrape/analyze data (Python)\n  Using Excel (Google Sheets, etc.) to find averages, most/least common (of a variable), identify outliers\n  Reading budgets, court documents, business filings\n  Request data/records from governments\n  Creating charts + maps  to look at data\n  Making user-facing tools (ie., calculator) (JavaScript)\n  and much more\n\n\nWhy data journalism\n\n  Scoop city. Population: you.\n  Answers big/small questions\n  Find “hidden” stories\n  Provide context/understanding\n\n\nData journalism examples\n\n  🔗Data journalism examples\n\n\nReview\n\n  What is data journalism?\n    \n      A kind of journalism done with data\n    \n  \n  What are some tools we can use to do data journalism?\n    \n      Excel, Google Spreadsheets, charting tools (DataWrapper, etc) \n    \n  \n\n",
        "link": "twitter.com/JessieWillms/1_what_is_data_journalism/04_what_is_data_journalism.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Basic math",
        "content": "Math :\n\nNote: Many of these tips are pulled from Quartz’s Bad Data Guide.\n\nFixing stuff\n\n  TK\n\n\nMore on math\n\n\n  🔗 Poynter: How to write about numbers\n\n",
        "link": "twitter.com/JessieWillms/02_working_with_data/05_basic_math.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "The \"data\" component of \"data journalism\"",
        "content": "Discussion question 🙋\n\n  What is the “data” component of data journalism?\n  Where do we find data?\n\n\n\n5 basic question for your data\n\n\n  What does this data represent? Is it a full or partial view? What cannot be answered by the data?\n  Can we trust this data? (Do you trust the sourcing, method of collection — why?)\n  Is this data clean? What errors or omissions are possible?\n  Is this data in a machine-readable format? If not (if it is not a CSV/spreadsheet) what are our next steps for extracting the information?\n  What can be extracted from this data? How can this information inform our reporting?\n\n\nSee also\n\n  🔗Data journalism examples\n  🔗Data sources\n\n\nExercise: Making data\n\nMaking a dataset of own own. Data + donuts\n\n\n",
        "link": "twitter.com/JessieWillms/1_what_is_data_journalism/05_what_is_data.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    

    
    ,{
        "title": "Visualizing data — identifying errors in bad charts",
        "content": "Bad charts\n\nProject requirements\n\n\n  Download this folder of “bad charts” bad_charts.zip This folder contains images of poorly executed charts, as well as the related data (in a CSV).\n  For each chart, identify the 2 most important issues with the chart*\n    \n      For each issue, explain:\n        \n          What is the issue? (2 point)\n          Why does this matter? How does it misrepresent or manipulate the data? (4 point)\n          How might you (as a reporter/editor) correct the issue (bullet points are fine). You might also suggest an alternative to running the chart. (4 point)\n        \n      \n    \n  \n  Make a copy of this Google doc to submit your answers. Fill out each table, then download the doc as a PDF (File &gt; Download as &gt; PDF). Upload your completed PDF to the folder on eCentennial.\n\n\n* Identify the most important issues/errors with a chart. If a chart uses colours that are low contrast, does not have an X or Y axis label, and the data is not adjusted for inflation, it is up to you to select the most important issue with the chart. You would be expected to explain why it is necessary to adjust for inflation and use labels on the axis. Colour contrast is a less important issue.\n\nEach chart: 10 points for each chart\n    - 2 points: What is the issue\n    - 4 points: Why does this matter?\n    - 4 points: How to fix issues\n\nTotal: 30 points\n\n\nGetting Started\n\n\n  Review the notes\n  Look at the chart critically\n    \n      What does the title indicate the chart is trying to show?\n      Do the labels match the content?\n      Is there a legend?\n      Are the X and Y axis labelled (are they correctly labelled)?\n      Do the numbers add up? (Do the numbers mean anything?)\n    \n  \n  Review the data associated with the charts\n    \n      Does the chart match the data?\n    \n  \n\n\nHere is what this might look like\nThe chart:\n\nSalt vs. sugar data bad-pie-chart-data.csv\n\nYour response:\n\n",
        "link": "twitter.com/JessieWillms/4_visualizing_data/exercises/bad_charts.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Visualizing data — making charts",
        "content": "Building better charts\n\nProject requirements\n\n\n  Download this folder of data making_charts.zip This folder contains the data you will need to build charts. The sources are listed in sources.docx.\n\n  For each CSV, ask yourself:\n    \n      What does the data show?\n      What are the limitations of the data? If prices are included: are those values adjusted for inflation?\n      What chart can you build to accurately reflect the CSV you are given?\n      Should I use all the data provided? Or is a portion of the data most compelling? Can I improve the clarity of my chart by using only a portion of the data?\n      Now build an accurate chart\n    \n  \n  Include:\n    \n      A chart title\n      A sub-title (if necessary)\n      A source line\n      A legend (if necessary)\n    \n  \n  Save each of your charts as images. Be sure the file name reflects the content of the chart (ie., facebook-user-data-chart.jpg). Upload them here to the folder on eCentennial.\n  Explain your choices — why this type of chart, why this data/portion of the data, etc. Make a copy of this Google doc. \n\n\nEach chart: 15 points\n    - 4 points for labels/titles\n    - 6 points for construction\n    - 5 points for explanation \n\nTotal: 60 points\n\n\nGetting Started\n\n\n  Review the notes\n  Look at the data\n    \n      Does it contain time information? If so, should this be used on a line or bar chart — why?\n      What information needs to be included in a title vs. sub-title?\n      What labels are necessary for the X and Y axis?\n      Do you need a legend?\n    \n  \n  Build a chart (using one of the available chart-building tools)\n  Review your chart.\n    \n      Does the chart match the data?\n      What is your chart saying?\n    \n  \n\n",
        "link": "twitter.com/JessieWillms/4_visualizing_data/exercises/building_charts.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Building a dataset",
        "content": "🍩 data\n\n\n  Refer to the Pudding’s README  for a useful reference\n  Refer to the previous lesson for the 5 questions you should ask your data \n\n\nProject\n\n\n  Open this blank Google spreadsheet\n  Each person takes one donut/Timbit from the box 🍩\n  As a group, decide 2-3 variables to record for each donut (serving size, sodium, iron, etc.).\n  Record the variables (column headers). The spreadsheet should include the 2-3 variables agreed upon in the last step, as well as:\n    \n      your name\n      name of donut selected\n      is it chocolate?\n      what type of donut? (see Tim Hortons website for categories)\n      grams of sugar\n      data source for the above information\n      AS WELL: data for the 2-3 variables picked in step 3\n    \n  \n  As a group, we will review the spreadsheet and talk about ways to ensure the data is being entered consistently\n \n  As a group, we will complete this sample README file\n    \n      Header: name of the column header (variable)\n      Description: what are the values in this cell?\n      Data type: what is the data type used? (Data type options include: number, true/false, date, text, URL)\n    \n  \n  In groups, answer one of the five questions (Group 4 will complete questions 4 + 5) Record your answers in this Google doc (bullet points are fine)\n\n\nYOUR GROUPS\nSection 1\nSection 2\n\nNext steps / discussion\n\n\n  Can we identify an outlier in this dataset?\n  How many total grams of sugar is in this box of donuts? (How many cups?)\n  What is the average calorie content of a donut?\n  What percent of the donuts were chocolate?\n  What was the most common type of donut? What was the least common?\n\n",
        "link": "twitter.com/JessieWillms/1_what_is_data_journalism/exercises/creating_data.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Project README",
        "content": "Build a dataset + project README\n\n\n  Refer to the Pudding’s README  for a useful reference\n\n\nProject\n\n\n  Open this blank Google spreadsheet\n  Each person takes one donut/Timbit from the box 🍩\n  As a group, decide 2-3 variables to record for each donut (serving size, sodium, iron, etc.).\n  Record the variables (column headers). The spreadsheet should include the 2-3 variables agreed upon in the last step, as well as:\n    \n      your name\n      name of donut selected\n      is it chocolate?\n      what type of donut? (yeast, cake, etc.)\n      grams of sugar\n      data source\n      AS WELL: data for the 2-3 variables picked in step 3\n    \n  \n  As a group, we will review the spreadsheet and talk about ways to ensure the data is being entered consistently (ie., using a dropdown for category options vs. each person typing their response).\n  As a group, we will complete this sample README file\n    \n      Header: name of the column header (variable)\n      Description: what are the values in this cell?\n      Data type: what is the data type used? (Data type options include: number, true/false, date, text, URL)\n    \n  \n\n\nNext steps / discussion\n\n\n  Can we identify an outlier in this dataset?\n  How many total grams of sugar is in this box of donuts? (How many cups?)\n  What is the average calorie content of a donut?\n  What percent of the donuts were chocolate?\n  What was the most common type of donut? What was the least common?\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/creating_data_set_readme.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Examples",
        "content": "Example projects\n\nSmall stories\n\n\n  Daily(ish) stories\n  Quick turnaround\n  Fast data analysis, simple charting (built with existing charting tools - Google Charts, DataWrapper)\n  work with existing (or just made available) data (from StatsCanada, etc.)\n  Example stories/topics:\n    \n      stock prices\n      employment/unemployment numbers\n      crime stats\n      housing data: Toronto area home sales fall to 10-year low in 2018 as number of listings dip\n      polling data\n      Dinesafe inspection data\n    \n  \n\n\nCanada’s heavy crude hits record low as oil patch troubles intensify\n\n\n  Oil numbers story\n  Chart with single variable\n\n\n\n\n\n\n\n\nMedium stories\n\n\n  Some advance work (or: advance work that enables quick turnaround when data is released)\n  Turn around time is measured in weeks (not months)\n  Some charts (possibly custom charting), custom maps\n  Examples:\n    \n      Cannabis stocks took over the TSX in 2018. This chart proves it\n      A Better Way To Think About December’s Jobs Numbers\n      These are all the places Ontario Liberals were beaten on election night\n    \n  \n\n\n\nCensus 2016: Western provinces’ populations are the fastest-growing in Canada\n\n\n\n\n\n\n\nLong-term (big) stories\n\n\n  Can include filing and process access to information requests (ATIP/FOI)\n  Scrapping, compiling, and analyzing data\n  Can include building custom interactive features (see “Will the police believe you?” lookup feature)\n  Major investigations, long-term commitment from reporting and data staff\n  Examples:\n    \n      How BuzzFeed News Used Betting Data To Investigate Match-Fixing In Tennis\n      Panama Papers\n      Oil patch fails to clean up growing stockpile of abandoned wells\n      What Went Wrong (Miami Herald/Steve Doig)\n      WaPo police shootings database\n  \n      Trump’s Lies\n      Trump Fact Check - database\n      ProPublica’s Machine Bias\n    \n  \n\n\nUnfounded: Police dismiss 1 in 5 sexual assault claims as baseless\n\n\n\nMore examples\n\n\n  Dear Mona\n    \n      Mona @ the Guardian\n      Mona’s podcast, Fortune Favours the Bold\n      Mona Chalabi: How many women have been nominated to be US president?\n    \n  \n  Dear Data (the project)\n    \n      Dear Data (Twitter) \n      Giorgia Lupi\n      Stefanie Posavec\n    \n  \n  The Upshot\n  The Guardian’s Datablog\n\n  What Went Wrong (Steve Doig)\n  Hip Hop vocabulary\n  The Internet Boy Band Database\n  Data Journalism Handbook: case studies\n  Data Journalism Handbook: examples\n\n",
        "link": "twitter.com/JessieWillms/00_bonus/examples.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    

    
    ,{
        "title": "Working with functions",
        "content": "## Using the various functions covered, complete the following tasks:\n\n#### Work with this [spreadsheet](https://docs.google.com/spreadsheets/d/1f_ArdzTp9-GErhuWXV-pJLH-_Ab7nOEcoLJpDO8PbN4/edit?usp=sharing)\n\nIn **trump_clinton_join**:\n\n- join `trump` and `clinton` data into one spreadsheet\n- join the latitude and longitude columns into one `lat_long` column (like this: `43.649000,-79.378110`)\n\nIn **nhl_player_salaries**:\n\n- find the total salary for the 2018-2019 NHL season\n- who was paid the most? who was paid the least?\n- what is the most common salary, what is the average salary\n- insert a new column; populate it with the total salary each player will earn from 2018-2023\n- what is the average total salary?\n\nIn **weather**:\n\n- use `past transpose` to return table data where the days of the week are in a column\n- add column headers\n- use function that returns `1` if the forecasted temperature is above 0, and returns `0` for weather below freezing\n- get a total of the days above freezing\n- in a new column, return `1` if the description includes the word 'sunny', and `0` if it does not (you will need multiple functions)\n- get a total of the 'sunny' days\n\nIn **best_selling_books**:\n\n- how many of the best selling books were published in English?\n- get the total `Approximate sales`\n- how many Harry Potter books made this list?\n- count how many books sold more than 75 million copies\n- what is the most common `genre`\n- in which decade were the most titles published?\n- who is the most popular author, by the number of books sold (how many books did they sell)\n\n**BONUS** in **math** from [the previous exercise](https://docs.google.com/spreadsheets/d/1e-KgZFRZOyX4F4B5-Icdbixi0AN2oPJlUv71LL3vQsY/edit?usp=sharing)\n\n- write a function, or series of functions, that checks if a movies is a sequel\n- what percent of the highest grossing movies are sequels (extra bonus: what is the percent change from 2017?)\n- hint: movies that are sequels includes either, a number (2), or a colon (:) and the subtitle\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/functions.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Glossary of terms",
        "content": "## Glossary of terms\n\n\n### Outlier\n\n__Outlier:__ one of these things is not like the other ones\n\n___Explain___ something is askew\n\n\n\n### File types\n\n__CSV:__ comma-separated values\n__TSV:__ tab-separated values\n\n___Explain___ ... we save spreadsheets without all that whitespace. TK.\n\n\n\n### Pivot Tables\n\n__CSV:__ it's a table\n![Pivot Table](img/pivot-lol.gif)\n___Explain___ ... in a spreadsheet ... used for analysis\n\n## Terms\n\n### File formats\n\n__CSV, TSV__\n\t- file types\n\t- comma- or tab-separated values\n\nCSV data might look like this (in a text editor):\n\n```\nname,gender,major_minor,type,cause,,first_episode_title_text,,last_episode_title_text,seasons_array\nHeather Brooks,female,major,intern resident,\"['Electrocution', 'Brain bleed']\",,Old Time Rock and Roll,,Old Time Rock and Roll,['12']\nHenry Burton,male,major,family,\"['Internal bleeding', 'Tumor', 'Diabetes']\",,17 Seconds,,17 Seconds,['2']\n\"Denny Duquette, Jr.\",male,major,patient,['Congestive Heart Failure'],,You Haven't Done Nothin',,You Haven't Done Nothin',['13']\nEllis Grey,female,major,family,\"[\"\"Alzheimer's disease\"\", 'Heart condition']\",,Suicide is Painless,,Suicide is Painless,['6']\nLexie Grey,female,major,intern resident,['Plane Crash injuries'],,Dark Was the Night,,Suddenly,['8']\nSusan Grey,female,major,family,\"['septic', 'toxic megacolon', 'hiccups']\",,All By Myself,,All By Myself,['5']\nGeorge O'Malley,male,major,intern resident,\"['Bus crash injuries', 'Brain death', 'Internal injuries']\",,Suddenly,,Suddenly,['8']\nCharles Percy,male,major,intern resident,['Gunshot wound'],,Dark Was the Night,,Suddenly,['8']\nDerek Shepherd,male,major,attending,\"['Car accident injuries', 'Brain death']\",,Invest in Love,,Invest in Love,['6']\nMark Sloan,male,major,attending,\"['Plane crash injuries', 'cardiac tamponade', 'Coma']\",,Perfect Little Accident,,Go Big or Go Home,\"['6', '14']\"\n```\n\nWhen opened in Google Spreadsheets or Excel, that data will look like this:\n\n![https://cl.ly/f5ae1b991f46](https://d3vv6lp55qjaqc.cloudfront.net/items/0f301e2C191E1M373p1M/Image%202018-12-27%20at%204.12.49%20PM.png?X-CloudApp-Visitor-Id=c1693d93b1996b2027c04ee6dfa73c11&v=afe63322)\n\n### Types of data\n- CSV\n\n### Tips for navigating your computer\n-\n\n\n\n### Number stuff\n\n__Mean/average:__ If we get the sum of all values divided by the number of observations.\n\n_Finding the average test score._\nScores: `76, 87, 78, 78, 91, 12, 67`\nAdd up all values: `76 + 87 + 78 + 78 + 91 + 12 + 67 = 489`\nDivide this total by number of values: `489 / 7`\nAverage test score: `69.86`\n\n\n\n__Median:__ If we sort the data, then find the value in the middle.\n\n_Finding the median test score._\nScores: `76, 87, 78, 78, 91, 12, 67`\nScores sorted: `12, 67, 76, 78, 78, 87, 91`\nMiddle (median) score: `78`\n\n\n\n__Mode:__ The value that occurs most frequently in the data.\n\n_Finding the most common test score._\nScores: `76, 87, 78, 78, 91, 12, 67`\nScores sorted: `12, 67, 76, 78, 78, 87, 91`\nMedian score: `78`\n\n\n\n__Rates:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Percentages, percentage change:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Variance and distribution:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Rolling averages:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Indexing:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Correlation and dependence:__ tk\n\n_Example:_\nHow to: `tk`\n\n\n\n__Compound growth rate:__ tk\n\n_Example:_\nHow to: `tk`\n\n## Review\n1. Define the median value\n\t* The middle value in a set of ordered values.\n1. Define the average value\n\t* Sum of all values, divided by the number of values.\n",
        "link": "twitter.com/JessieWillms/00_bonus/glossary_of_terms.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Working with IMPORT",
        "content": "## Using various `IMPORT` functions, answer these questions in a summary table.\n\n- What is the total gross for the **top 10** highest grossing films?\n- What is the total gross for the complete list?\n- How many of the highest grossing films were released since 2000?\n- Import the top 10 highest grossing films\n\nNote: Record your answers in the `data_work` tab of this [spreadsheet](https://docs.google.com/spreadsheets/d/17V2PtNTpYoqYAowwQk7IP6pPn21z_Q36y6TXrqjypho/edit?usp=sharing).\n\n### Step 1: Find and import the data.\n\n**Wikipedia:** [Highest grossing films, ever](https://en.wikipedia.org/wiki/List_of_highest-grossing_films)\n\nIn a tab/sheet called `highest_grossing_films`: Use the `IMPORTHTML` function to load the Wikipedia table into your spreadsheet.\n\n![Split to columns](../img/vlookup-1.gif)\n\n### Step 2: Perform calculations, import in the answers tab\n\n\n- Use the `IMPORTRANGE` function to report your answers in the `data_work` tab. (Wrap your calculations in an import function to avoid duplicating the answers.)\n\n\n\n\n| Review: what we covered |   |\n| :------------- | :------------- |\n| SUM functions       | ✅       |\n| IMPORTHTML function       | ✅       |\n| Wrapping functions      | ✅       |\n\n#### More on VLOOKUP\n[VLOOKUP](https://exceljet.net/excel-functions/excel-vlookup-function)\n[YouTube video](https://www.youtube.com/watch?v=E7gQ-PgYkMc)\n[Google support for VLOOKUP](https://support.google.com/docs/answer/3093318?hl=en)\n[ISNA](https://support.google.com/docs/answer/3093293?hl=en)\n[IF](https://support.google.com/docs/answer/3093364)\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/import.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Search",
        "content": "  Search\n  \n  \n  \n    Search term\n    \n    \n  \n\n  \n  \n     result(s) found for &ldquo;&rdquo;.\n  \n  \n\n\n\n  \n  \n\n  \n  \n\n  \n  \n",
        "link": "twitter.com/JessieWillms/search/",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Data training",
        "content": "",
        "link": "twitter.com/JessieWillms/",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    

    
    ,{
        "title": "Resources",
        "content": "## Resources\n\n### Change Detection\n[changedetection.com](https://visualping.io/cdlp.html?utm_source=cd&utm_medium=redirtocdlp&utm_campaign=mig1)\n\n___What is it___ You will make mistakes and mess up a spreadsheet of information. You need to have a way to revert all your changes without affecting the integrity of the data\n___When can you use it___ lalala\n\n\n\n### Open Refine\n[changedetection.com](http://openrefine.org/)\n\n___What is it___ A tool for working with messy data\n___When can you use it___ lalala\n\n\n\n###\n[Cometdocs](https://www.cometdocs.com/)\n\n___What is it___  \n___When can you use it___ [Example](https://www.cdc.gov/nchs/data/dvs/provisional_tables/provisional_table01_2015dec.pdf)\n\n\n\n###\n[Tabula](http://tabula.technology/)\n\n___What is it___ Get data from PDFs\n___When can you use it___\n",
        "link": "twitter.com/JessieWillms/00_bonus/resources.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Working with spreadsheets",
        "content": "## Using various functions, answer these questions in a summary table.\n\n- How many one bedroom apartments are currently listed on Craigslist Toronto?\n- How many of the `Highest-grossing films of 2018` were distributed by Disney?\n- What is the most expensive product on the first page of products on the Ontario Cannabis Store?\n- Bonus: What is the most expensive non-Accessory product on the first page of products on the Ontario Cannabis Store?\n- Find the JSON of product data, convert it to a CSV, and sort the data\n- How many people named `Josh` made the Sunshine List?\n- For people named `Josh` in 2016, what was their combined salary in 2016?\n- For people named `Josh` in 2016, what was their average salary?\n- For people named `Josh` in 2016, which Josh made the most? Which made the least?\n- In 2013, who spent more on office supplies: Norm Kelly or Mike Layton? How much did they spend?\n\nNote: Record your answers in the `data_work` tab of this [spreadsheet](https://docs.google.com/spreadsheets/d/1VTmZ75kkhZjX2fahVaye62q-fH8liaVJxqwO-mN1H_c/edit?usp=sharing).\n\n## Finding the data\n\n- City of Toronto - [breastfeeding clinics](https://www.toronto.ca/community-people/children-parenting/pregnancy-and-parenting/breastfeeding/services/breastfeeding-clinics/)\n- Maclean's - [university rankings](https://www.macleans.ca/education/university-rankings/university-rankings-2019-canadas-top-primarily-undergraduate-schools/)\n- CBC - [Canada-specific news](https://www.cbc.ca/cmlink/rss-canada)\n- Craigslist - [1 bedroom apartments in Toronto](https://toronto.craigslist.org/search/apa)\n- Grey's Anatomy - [U.S. television ratings](https://en.wikipedia.org/wiki/Grey%27s_Anatomy)\n- Wikipedia - [Highest-grossing films of 2018](https://en.wikipedia.org/wiki/List_of_2018_box_office_number-one_films_in_the_United_States\n\n\n\n\n| Review: what we covered |   |\n| :------------- | :------------- |\n| MAX function      | ✅       |\n| SUM function       | ✅       |\n| Using custom Google Sheet functions      | ✅       |\n| IMPORTHTML functions      | ✅       |\n| Wrapping functions      | ✅       |\n\n#### More on VLOOKUP\n[VLOOKUP](https://exceljet.net/excel-functions/excel-vlookup-function)\n[YouTube video](https://www.youtube.com/watch?v=E7gQ-PgYkMc)\n[Google support for VLOOKUP](https://support.google.com/docs/answer/3093318?hl=en)\n[ISNA](https://support.google.com/docs/answer/3093293?hl=en)\n[IF](https://support.google.com/docs/answer/3093364)\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/spreadsheet_work.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Working with VLOOKUP — SOLUTION",
        "content": "## SOLUTION\n\n- **Question** Which of the highest grossing touring artists from 2018 **also** made the list of highest attendance at a show?\n- **Answer** U2, ...\n\n### Step 1: Find and import the data.\n\n**Step A.** Copy and paste the Billboard data. Split on the semi-colon. Correct the Shania Twain value. Rename tab to `2018_tours`.\n\n![Import data 1](vlookup_solution/step-1-copy-data.gif)\n\n**Step 2.** Use the `IMPORTHTML` function to pull in table data from Wikipedia (it is the second table on the page). The function should look like this:\n\n`=IMPORTHTML(\"https://en.wikipedia.org/wiki/List_of_highest-attended_concerts\", \"table\", 2)`\n\n![Use IMPORTHTML to get table](vlookup_solution/step-1-get-table.gif)\n\n**Step B.** When you use the the IMPORTHTML function, you are opening a connection between your spreadsheet and the website where the data table is live on the internet. In order to work with the data, you must remove that connection.\n\nOption 1: Copy + paste special (being on the lookout for date formatting errors).\n\n_Option 2:_ Download the data as a CSV and re-import the data. The advantage of this option is it is 1. usually pretty fast, and 2. is less likely to encourage errors in the data (specifically date formats).\n\n![highest attended concerts](vlookup_solution/step-1-replace-data.gif)\n\nNow we are able to sort, filter, and otherwise _use_ the data.\n\n**Step C.** Correct the `Attendance` column.\n\nWe can now use the built-in `split text to columns` function to correct the Attendance column. Note: When using this function, whatever content is _to the right of your splitting character_ will be returned in the next column.\n\nIn our example: the data we want is in column F (Attendance), and the references/citations are in the next column (G). For this example, it's okay column G will be overwritten since we don't need the citations.\n\nWe will use the `♠` character to split this column. The we will rename the column, and delete unnecessary data.\n\n![split highest attended concerts](vlookup_solution/step-3-split-column.gif)\n\n### Step 2: Check the data.\n\nFirst, you should notice in your data about highest attended concerts is missing some data. Before working with this sheet, be sure to correct empty cells.\n\nThis is a good use case for two things:\n\nTip 1. Create a new column and populate it with a counter. This will allow us to put the data back in its original order after we sort and filter the sheet.\n\nAfter the counter is created, we can sort a column (Z-A) to find empty cells.\n\n![counter + sort to find empty cells](vlookup_solution/counter-sort-empty-cells.gif)\n\nTip 2. Using conditional formatting to highlight empty cells.\n\nOnce you identify the missing cells, populate the missing information. In this case, Oasis and Robbie Williams performed back-to-back dates at the same venue. We can copy/paste the missing values.\n\nAlso be sure to replace the `•` character (Edit > Find + replace). On Wikipedia, this character indicated the concert was the highest-attended of all time up to that point.\n\n![conditional formmating](vlookup_solution/conditional-formatting.gif)\n\n\n\nIn order to use VLOOKUP, we need the fist column (column A) in both sheets to contain the same variable. In our example, we need artist names in the first column. Drag the columns to reorder.\n\n![reorder](vlookup_solution/reorder.gif)\n\n### Step 3: Data work\n\nCreate a dropdown menu that lists the artists from the highest grossing tour list.\n\n![data validation to make list](vlookup_solution/data-validation-make-list.gif)\n\nThen write a VLOOKUP function that looks for a match to the value (artist) in B2 (our dropdown menu of artist names).\n\nThis is what the function will look like:\n\n```\n=VLOOKUP(B2, highest_attended_concerts!A2:G25, 1, false)\n```\n\nVLOOKUP is a function that takes three parameters (or arguments).\n\nThe first parameter, `B2`: This the reference to the value we are looking for. In our example, we created a dropdown menu so we can easily look for a match without typing each artist's name. `B2` is a reference to a string value.\n\nThe second parameter, `highest_attended_concerts!A2:G25`: This is where we are looking for the artist (referenced in `B2`). In this example, we are looking in a sheet called `highest_attended_concerts`. We are then looking in a range of values, starting at `A2` and ending at `G25`. These two values are separated by an exclamation mark (`!`).\n\nThe second parameter, `1`: This is the index. When VLOOKUP returns a match, this is the column index of the value to be returned. So, if we want to return the name of the artist (the match), we use `1` because in `highest_attended_concerts` the artist name is the first column.\n\nTo return the number of people who attended that show, we would use an index of 7, for column G (attendance). 🔗[Screenshot](https://cl.ly/36b29e53aed0/annotate)\n\n![VLOOKUP](vlookup_solution/writing-the-vlookup-function.gif)\n\nWe can look through the options in the dropdown for matches. __U2__, for example, had a highest attended show, and a highest grossing 2018 tour.\n\nHowever, while __Ed Sheeran__ made $429,491,502 touring in 2018, he does not have a \"highest attended\" show. His name returns an `N/A` error.\n\n![no match](vlookup_solution/no-match.png)\n\nWhile this `N/A` error is fine, we can wrap our function to produce a nicer, cleaner result.\n\nWe can wrap the lookup function in another function that checks for errors and returns a boolean value.\n\nThis is what the function will look like:\n\n```\n=ISNA( VLOOKUP(B2, highest_attended_concerts!A2:G25, 1, false)\n```\n\nWhen there is an error, this function will evaluate TRUE. Otherwise, it will return FALSE.\n\n![ISNA](vlookup_solution/isna.gif)\n\nWe can now wrap our error handling function in another function. We can use the `IF` to return the name of the artist if they are on the attendance list, and return a string of text otherwise.\n\nThis is what the function will look like:\n\n```\n=IF( ISNA( VLOOKUP(B2, highest_attended_concerts!A2:G25, 1, false)), \"Not on the list.\", B2)\n```\n\n![IF](vlookup_solution/isna.gif)\n\nWe can continue to wrap and build out this function to return other values from the same row.\n\nFor example, we can check that are artist is on the highest attended concerts list, then return the date of the show, the city, and how many tickets were sold.\n\nThis is what the function will look like:\n\n```\n=IF( ISNA( VLOOKUP(B2, highest_attended_concerts!A2:G25, 1, false)), \"NOT on the list\", VLOOKUP(B2, highest_attended_concerts!A2:G25, 3, false))\n```\n\n![Many function many retunrs](vlookup_solution/many-functions-many-returns.png)\n\n### Next steps\n\nWhat happens when there is more than one match? _For example, U2 is on the highest attended concerts list more than once._\n\n\n#### More on VLOOKUP\n[More than one match](https://www.ablebits.com/office-addins-blog/2017/02/22/vlookup-multiple-values-excel/)\n\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/vlookup-SOLUTION.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Working with VLOOKUP",
        "content": "## Using `VLOOKUP` to answer the question:\n\n- Which of the highest grossing touring artists from 2018 **also** made the list of highest attendance at a show?\n\n### Step 1: Find and import the data.\n\n**Billboard:** [Highest grossing 2018 tours](https://www.billboard.com/articles/events/year-in-music-2018/8488851/touring-charts-year-ed-sheeran-tops-taylor-swift-beyonce)\n**Wikipedia:** [List of highest-attended concerts](https://en.wikipedia.org/wiki/List_of_highest-attended_concerts)\n\nIn a tab/sheet called `2018_tours`: Copy and paste the `2018 TOP 25 TOURS` data into a Google Spreadsheet. Use the `split text to columns` function to convert this CSV-ish data into a well-structured table.\n\n![Split to columns](../img/vlookup-1.gif)\n\nIn a tab/sheet called `highest_attended_concerts`: Use the `IMPORTHTML` function to import the table of highest-attended concerts from Wikipedia. (You will need the `split text to columns` to correct the formatting on the `Attendance` column.)\n\n![IMPORTHTML](../img/vlookup-2.gif)\n\n### Step 2: Check the data.\n\n**This is important:** In order to use the `VLOOKUP` function, the fist column of data (`column A`) in ~both~ sheets needs to contain the same variable (ie., the artist name). This value is our 🔑 (our unique identifier, our ID).\n\nIn a tab/sheet called `2018_tours`: move the `Rank` column one to the right. (So the artist names, our key, is in the first column).\n\nWe can also re-name the column headers for the `artist/act` columns so that variable is consistent in both tabs. We can use `artist`.\n\n![Rename columns](../img/vlookup-3.gif)\n\n### Step 3: Data work\n\nIn a new tab (call it `data_work` or something similar): Use `data validation` to create a dropdown menu that lists the artists from the highest grossing tour list (tab/sheet name: `2018_tours`).\n\n* In cell `B2`\n* Open the data validation modal: Go `Data > Data validation`\n* Under `Criteria` > select `List from a range` > then select the column of artist names `2018_tours!A2:A100`\n* This will create a dropdown list in the cell.\n\n![Split to columns](../img/vlookup-4.gif)\n\nIn `data_work`: write the `VLOOKUP` function to compare the value of `B2` with the value of any cell in `column A `in `highest_attended_concerts`.\n\n* In cell `B3`\n* Write the `VLOOKUP` function:\n\n```\n=VLOOKUP(search_key, range, index, true_false)\n```\n\n**search_key**: what we want to look for: a value, or a reference to a value.\n    - `B2` (the cell with the dropdown menu)\n\n**range**: where we are looking for the value\n    - `highest_attended_concerts!A1:E100`\n    - the sheet (`highest_attended_concerts`), `!`, and the range (`!A1:E100`)\n    - always select the full range of data\n    - we are selecting from the first cell in the top right to beyond the last cell of data in the last column - `E100`\n\n**index**: which column to return\n    - `1`: the first column (the name of the artist)\n    - `5`: the attendance at that show\n\n**true_false**: true/false if the data is sorted\n    - `false`\n\n...all together:\n\n```\n=VLOOKUP(B2, highest_attended_concerts!A1:E25, 1, false)\n```\n\nIf you see `#N/A`, the lookup function did not return a match. When you see an artist name, that is the match.\n\n![Split to columns](../img/vlookup-5.png)\n\nWe can update the `index` value to return the name of the tour, the number of people in attendance, or any other value from the attendance list. (Hint: when looking for a match, start with some of the ~older~ artists. You should find two matches.)\n\nWe can wrap the lookup function in another function, to return the name of the artist if they are on the attendance list (`TRUE`), and return a string of text otherwise (`FALSE`).\n\n```\n=IF( ISNA(VLOOKUP(B3, highest_attended_concerts!A1:B100, 1, false)), \"Not on the attendance list\", B3 )\n```\n\n`ISNA`: Checks whether a value is the error `#N/A`.\n\n`ISNA(A2)`\n\n`IF`: Checks against a true/false statement, returns 1 or 0\n\n`IF(logical_expression, value_if_true, value_if_false)`\n\n\n\n\n| Review: what we covered |   |\n| :------------- | :------------- |\n| Split text to columns       | ✅       |\n| IMPORTHTML function       | ✅       |\n| Paste special       | ✅       |\n| Data validation: create a dropdown list        | ✅       |\n| VLOOKUP function        | ✅       |\n| Bonus: VLOOKUP function wrapped in an IF function        | ✅       |\n\n#### More on VLOOKUP\n[VLOOKUP](https://exceljet.net/excel-functions/excel-vlookup-function)\n[YouTube video](https://www.youtube.com/watch?v=E7gQ-PgYkMc)\n[VLOOKUP at Starbucks](http://www.excelcampus.com/functions/excel-vlookup-explained/)\n[Google support for VLOOKUP](https://support.google.com/docs/answer/3093318?hl=en)\n[ISNA](https://support.google.com/docs/answer/3093293?hl=en)\n[IF](https://support.google.com/docs/answer/3093364)\n\n\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/vlookup.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "What is data journalism review",
        "content": "# What is data journalism - Pitch a data story\n\n\n## Project requirements\n\n1. Identify 2-3 \"data\" resources\n2. Outline the structure of your story\n3. Light data analysis in Excel/Google Spreadsheets\n4. Create a Pivot Table\n\n**Bonus points for exploring topics we haven't covered yet!**\n\n## Getting Started\n\n1. Review the datasets we covered.\n2. Look at some of the data-driven stories we covered. What angels were unexplored?\n3. Consider data stories that we write on a weekly/monthly basis — housing/rental pricing data, for example.\n\n##### Here is the base HTML to get you started:\n\n    \n    \n        \n            My First Project\n            \n        \n        \n            get going!\n        \n    \n",
        "link": "twitter.com/JessieWillms/1_what_is_data_journalism/weekly_project1.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

    
    ,{
        "title": "Working with spreadsheets",
        "content": "# Reference\n\n* [What is a spreadsheet](/3_working_with_spreadsheets/01_what_is_a_spreadsheet.html)\n* [Spreadsheet basics](/3_working_with_spreadsheets/02_spreadsheet_basics.html)\n* [Spreadsheet tips](/3_working_with_spreadsheets/02_spreadsheet_tips.html)\n* [Sorting, filtering, basic functions](/3_working_with_spreadsheets/03_filtering_sorting_functions.html)\n* [Pivot Tables](/3_working_with_spreadsheets/03_pivot_tables_advanced.html)\n\n## Project\n\nTo practice your spreadsheet skills, download this CSV 👽: **ufos.csv**\n\n1. Complete spreadsheet tasks (listed on eCentennial)\n\n2. 🔗[Then complete this quiz](https://goo.gl/forms/bDQu4aVwMLTAeqEI3)🔗\n\n3. For any question where you execute a function, record your answers in a tab called `answer_key`.\n\n![answer key](./img/answer_key.png)\n\n4. Complete a project README/data dictionary using a 🔗[copy of this doc](https://docs.google.com/document/d/1rtFA2bHBqfYBjN7hrkeH7Zki6rhir2uldWiSK5szjG8/edit?usp=sharing)🔗\n\n*A note about Google Forms* Google Forms does not allow you to save your work mid-quiz. You might consider recording your answers in a Google or Word doc, then submitting your answers once completed.\n\n\n\n**Bonus**\n\n- Create a text document that outlines the steps you took for any complex answers (see the lesson: [02_spreadsheet_tips](/2_working_with_spreadsheets/02_spreadsheet_tips.html).) (+1% to your final mark)\n- Create a text document that answers the 5 question: [02_spreadsheet_tips](/2_working_with_spreadsheets/02_spreadsheet_tips.html).) (+1% to your final mark)\n",
        "link": "twitter.com/JessieWillms/3_working_with_spreadsheets/exercises/working_with_spreadsheeets.html",
        "date": null,
        "excerpt": null,
        "seach_omit": ""
    }
    
    

]